app/views/messages/index.html.erb

            <td valign="top" class="message-pic"><%= image_tag message.author.avatar.url(:thumb) %></td>
            <td valign="middle" class="message-text"><span id="fridge-author"><%= message.author.first_name.capitalize %> <%= message.author.last_name.capitalize[0] %>.</span> <span id="fridge-title">posted <%= time_ago_in_words(message.created_at) %> ago </span><br>
---
SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 5