app/views/users/show.html.erb


<% if @user.houses.length != 0 %>
---
SELECT "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  [["user_id", 1]]