app/views/events/index.html.erb

      <div class="each-event">
      <%= image_tag("issue-mark.png", size: "50x50", class: "issue-mark")%> <%= event.user.first_name %>: <%= event.name %> <br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]