app/controllers/chores_controller.rb

  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      @user_house = @user.houses.first
      if @user_house == @house
        @chores = @house.chores
        @users = @house.users
        @housing_assignment = HousingAssignment.find_by(house_id: @house.id, user_id: @user.id)
        @chore_logs = @house.users.map {|user| user.chore_logs}
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1 AND "housing_assignments"."user_id" = $2 LIMIT 1  [["house_id", 1], ["user_id", 1]]
SELECT "chores".* FROM "chores" WHERE "chores"."house_id" = $1  [["house_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "housing_assignments" ON "users"."id" = "housing_assignments"."user_id" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "chore_logs".* FROM "chore_logs" WHERE "chore_logs"."user_id" = $1  [["user_id", 1]]
SELECT id, task FROM "chores"

  def show
    @user = current_user
    @chore = Chore.find_by(id: params[:id])
    @house = @chore.house
    @chores = @house.chores
    @logged_users = @chore.chore_logs.map{|log| log.user_id }
    @logged_users.uniq!
    if @logged_users.size > 1
---
SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "chore_logs".* FROM "chore_logs" WHERE "chore_logs"."user_id" = $1 AND "chore_logs"."chore_id" = $2  [["user_id", 1], ["chore_id", 2]]
SELECT COUNT(*) FROM "chore_logs" WHERE "chore_logs"."user_id" = $1 AND "chore_logs"."chore_id" = $2  [["user_id", 1], ["chore_id", 2]]

  def create
    if @user = current_user
      @house = House.find_by(id: params[:house_id])
      @chore = @house.chores.new(chore_params)
      @users = @house.users
      if @chore.save
          @notification = Notification.create(alert: "#{current_user.first_name} has added #{@chore.task} to Chores.", category: "chores", house_id: @house.id)
---
INSERT INTO "chores" ("task", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task", "yay!"], ["house_id", 1], ["created_at", "2015-04-19 02:14:50.282292"], ["updated_at", "2015-04-19 02:14:50.282292"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "chores".* FROM "chores" WHERE "chores"."house_id" = $1  [["house_id", 1]]