app/controllers/chore_logs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @users = @house.users

    @chore = Chore.find_by(id: params[:chore_id])
    @chore_logs = @house.users.map {|user| user.chore_logs}