app/controllers/communal_items_controller.rb

SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "communal_items".* FROM "communal_items" WHERE "communal_items"."house_id" = $1  [["house_id", 1]]
---
  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      if @user.houses.first == @house
          @items = @house.communal_items
          @stock_levels = ["high","low","out"]
          @items_by_level = @items.all.group_by(&:stock_level)

INSERT INTO "communal_items" ("name", "stock_level", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "milk"], ["stock_level", "out"], ["house_id", 1], ["created_at", "2015-04-19 05:19:44.506154"], ["updated_at", "2015-04-19 05:19:44.506154"]]
SELECT "communal_items".* FROM "communal_items" WHERE "communal_items"."house_id" = $1  [["house_id", 1]]
---
  def create
      @house = House.find(params[:house_id])
      @item = @house.communal_items.create(item_params)
      if @item.save
        @notification = Notification.create(alert: "#{current_user.first_name} has added #{@item.name} to the inventory.", category: "communal_items", house_id: @house.id)