app/controllers/events_controller.rb

  def create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @housing_assignment = HousingAssignment.find_by(house_id: @house.id, user_id: @user.id)
    @event = @housing_assignment.events.new(event_params)
    if @event.save
---
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1 AND "housing_assignments"."user_id" = $2 LIMIT 1  [["house_id", 1], ["user_id", 1]]
INSERT INTO "events" ("description", "date", "name", "housing_assignment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def index
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @housing_assignments = HousingAssignment.where(house_id: @house.id)
    @events = @housing_assignments.map {|house_assignment| house_assignment.events}
---
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events" INNER JOIN "housing_assignments" ON "events"."housing_assignment_id" = "housing_assignments"."id" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]