app/controllers/events_controller.rb

SELECT "events".* FROM "events" INNER JOIN "housing_assignments" ON "events"."housing_assignment_id" = "housing_assignments"."id" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]
---
  def create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @event = @house.events.new(event_params)
    @event.save
    @notification = Notification.create(alert: "#{current_user.first_name} has added #{@event.name} to Events.", category: "events", house_id: @house.id)