app/controllers/houses_controller.rb

SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."user_id" = $1 AND "housing_assignments"."house_id" = $2 LIMIT 1  [["user_id", 1], ["house_id", 1]]
---
  def show
    @user = current_user
    @house = @user.houses.first
    @address = @house.address
    if HousingAssignment.find_by(user_id: @user.id, house_id: @house.id)

INSERT INTO "houses" ("name", "house_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MY HOUSSSEEEEEE"], ["house_key", "fldksjflsdkjflkdsjfdsf"], ["created_at", "2015-04-22 14:24:37.206881"], ["updated_at", "2015-04-22 14:24:37.206881"]]
INSERT INTO "addresses" ("street", "city", "state", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["street", "righregkjh"], ["city", "`flkfdjglrkegj"], ["state", "il"], ["zip_code", 60613], ["created_at", "2015-04-18 16:50:02.040331"], ["updated_at", "2015-04-18 16:50:02.040331"]]
INSERT INTO "housing_assignments" ("user_id", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["house_id", 1], ["created_at", "2015-04-18 16:50:02.113153"], ["updated_at", "2015-04-18 16:50:02.113153"]]
---
  def create
    @user = current_user
    if @user.houses != nil
    @house = House.new(house_params)
    if @house.save
      @address = @house.address=Address.new(address_params)
      if @address.save
        @user.housing_assignments.create(user: @user, house: @house)