app/controllers/houses_controller.rb

SELECT  "property_managers".* FROM "property_managers" WHERE "property_managers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @house = House.find(params[:id]).includes(:property_manager)