app/controllers/issues_controller.rb

SELECT  "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
---
  def rule_issue_new
    @rule = Rule.find_by(id: params[:rule_id])
    @house = House.find_by(id: params[:house_id])
    @presenter = {
      :issues => @rule.issues,
      :users => User.all,
      :form => {

SELECT  "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "issues" ("reason", "issuable_id", "issuable_type", "issuer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reason", "say hi to everyone"], ["issuable_id", 1], ["issuable_type", "Rule"], ["issuer_id", 1], ["created_at", "2015-04-19 19:04:31.181094"], ["updated_at", "2015-04-19 19:04:31.181094"]]
---
  def rule_issue_create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @rule = Rule.find_by(id: params[:rule_id])
    @issue = @rule.issues.create(reason: params[:issue][:reason], user_id: @user.id)

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 1]]
---
  def chore_issue_new
    @chore = Chore.find_by(id: params[:chore_id])

SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "issues" ("reason", "user_id", "issuable_id", "issuable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reason", "No!!!!!!!!!!!"], ["user_id", 1], ["issuable_id", 1], ["issuable_type", "Chore"], ["created_at", "2015-04-18 22:07:23.258872"], ["updated_at", "2015-04-18 22:07:23.258872"]]
---
  def chore_issue_create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @chore = Chore.find_by(id: params[:chore_id])
    @issue = @chore.issues.create(reason: params[:issue][:task], user_id: @user.id)

SELECT  "communal_items".* FROM "communal_items" WHERE "communal_items"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "issues" ("reason", "user_id", "issuable_id", "issuable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reason", "NO!!!!!"], ["user_id", 1], ["issuable_id", 1], ["issuable_type", "CommunalItem"], ["created_at", "2015-04-18 22:21:42.720148"], ["updated_at", "2015-04-18 22:21:42.720148"]]
---
  def item_issue_create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @item = CommunalItem.find_by(id: params[:communal_item_id])
    @issue = @item.issues.create(reason: params[:issue][:reason], user_id: @user.id)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def event_issue_new
    @event = Event.find_by(id: params[:event_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "issues" ("reason", "user_id", "issuable_id", "issuable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reason", "No Party!!!!"], ["user_id", 1], ["issuable_id", 1], ["issuable_type", "Event"], ["created_at", "2015-04-18 22:31:46.677999"], ["updated_at", "2015-04-18 22:31:46.677999"]]
---
  def event_issue_create
    @user = current_user
    @house = House.find_by(id: params[:house_id])
    @event = Event.find_by(id: params[:event_id])
    @issue = @event.issues.create(reason: params[:issue][:name], user_id: @user.id)