app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 5
---
  def index
    @house = House.find(params[:house_id])
    @presenter = {
      :messages => Message.last(5),
      :form => {