app/controllers/messages_controller.rb

SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 2]]
---
  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      if @user.houses.first == @house

SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("content", "housing_assignment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "heyyyyy"], ["housing_assignment_id", 1], ["created_at", "2015-04-18 18:47:45.737397"], ["updated_at", "2015-04-18 18:47:45.737397"]]
SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 5
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1 AND "housing_assignments"."user_id" = $2 LIMIT 1  [["house_id", 1], ["user_id", 1]]
---
  def create
    @house = House.find(params[:house_id])
    @user = current_user
    if @user.houses.first == @house
      @house = House.find(params[:house_id])
      @message = @house.messages.new(message_params)
      @message.update_attributes(author: current_user)
      if (params[:message][:picture])
        @picture = Picture.new(picture_content: params[:message][:picture][:picture_content], message_id: @message.id)
        if @picture.save
          if @message.save
              @notification = Notification.create(alert: "#{current_user.first_name} has posted a new picture on the fridge.", category: "messages", house_id: @house.id)
              HousingAssignment.where(house_id: @house.id).select do |assignment|