app/controllers/property_managers_controller.rb

  def edit
    @house = House.find(params[:house_id])
    @manager = PropertyManager.find(params[:id])
---
SELECT  "property_managers".* FROM "property_managers" WHERE "property_managers"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @house = House.find(params[:house_id])
    @manager = PropertyManager.find(params[:id])
---
SELECT  "property_managers".* FROM "property_managers" WHERE "property_managers"."id" = $1 LIMIT 1  [["id", 1]]