app/controllers/rules_controller.rb

  def create
    if @user = current_user
      @house = House.find(params[:house_id])
      @rule = @house.rules.new(rule_params)
      @rule.save
      @notification = Notification.create(alert: "#{current_user.first_name} has added #{@rule.content} to the house rules.", category: "rules", house_id: @house.id)
---
SELECT "rules".* FROM "rules" INNER JOIN "housing_assignments" ON "rules"."housing_assignment_id" = "housing_assignments"."id" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]