app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    if @currentuser = current_user
      @user = User.find(params[:id])

INSERT INTO "users" ("first_name", "last_name", "email", "phone", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save