app/views/chores/index.html.erb

SELECT COUNT(*) FROM "chore_logs" WHERE "chore_logs"."chore_id" = $1  [["chore_id", 1]]
SELECT id, task FROM "chores"
---
  <%= chore.task %> <br>
  Completed :<%= chore.chore_logs.size %> <br>