app/views/chores/show.html.erb

      <table class="user_logs">
        <% logs =  user.chore_logs.where(chore_id: @chore.id ) %>
---
SELECT "chore_logs".* FROM "chore_logs" WHERE "chore_logs"."user_id" = $1 AND "chore_logs"."chore_id" = $2  [["user_id", 1], ["chore_id", 2]]