app/views/rules/index.html.erb

  <li>
  <%= rule.housing_assignment.user.first_name %>: <%= rule.content %> <%= link_to "Issue this Rule", "/houses/#{@house.id}/rules/#{rule.id}/issues/rule_issue_new" %><br>
---
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1 LIMIT 1  [["house_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]